[Caption]
P_Caption                           =mToken GM3000 Certificate Utility
K_Set_No                            =Set Failed
P_MSGTitle                          =Information
K_Dead                              =Token is locked
K_PIN_Error                         =Wrong User PIN
K_ISTry                             =Try again?
K_Try_Time                          =You can try %d times.
K_DEL_YES_NO                        =Are you sure to delete it?
K_DEL_Error                         =Delete failed
K_ErrorCODE_Str                     = ErrorCode
K_Create_Cont_Error                 =Failed to create container.
K_spec_mode1                        =The key exchange certificate already exists.
K_Spec_mode2                        =The key signature certificate already exists.
K_Cover                             =Overwrite?
K_Import_Error                      =Failed to import the certificate.
K_OldCheck                          =Wrong Old User PIN, You can try %d times.
K_Login                             =Login
K_Info_hardwareVer                  =Hardware Version
K_Logout                            =Logout
K_Find_Error                        =Not Find Token
K_GetKeyInfo_Error                  =No Device
K_GetKeyCert_Error                  =Failed to get certificate information.
K_Null_cont                         =(Empty)
K_Cont                              =(Container)
K_Cont_NullName                     =Container name is empty, please re-enter
K_Cert_mode1                        =Key Exchange Certificate
K_Cert_mode2                        =Signature Certificate
K_RSA_Pub                           =Public Key
K_RSA_Pri                           =Private Key
K_EndTime                           =Expired
K_Cont_Name                         =Certificate Container
K_Key_Arrival                       =Connected
K_Set_Yes                           =Set Successfully
I_SelectCert                        =Please select a certificate file.
K_Cert_Name                         =Issue to
K_Cert_issure                       =Issuer
K_Cert_Ver                          =Version
K_Cert_Serial                       =Serial Number
K_Cert_begin                        =Valid from
K_Cert_End                          =Valid to
K_Cert_RSA                          =Algorithm
K_Info_labelName                    =Token Name
K_Info_Sn                           =Serial Number
K_Info_manufacture                  =Manufacturer
K_Info_model                        =Model
K_Info_maxPinLen                    =Max PIN Length
K_Info_minPinLen                    =Min PIN Length
K_Info_totalMemory                  =Total Memory
K_Info_freeMemory                   =Free Memory
Main_Form_Groupbox                  =Certificates
K_Info_firmVer                      =Firmware Version
S_System_Ver                        =OS
S_IE_Ver                            =IE Browser Version
S_Connect                           =Connected
S_DisConnect                        =Not Connected
S_KeyConnectState                   =Connection Status
S_KeyTryTime                        =User PIN Try Times
S_Key_Dead_Yes                      =Locked
S_Key_Dead_No                       =Unlocked
S_Key_Dead_State                    =Token State
S_CSP_Install                       =Installed
S_CSP_NullInstall                   =Not Installed
S_CSP_State                         =CSP Installation
S_CSP_Ver                           =CSP Version
S_PKCS11_Ver                        =PKCS11 Version
About_Form_Label_URL                =Web Site
About_Form_Label_Email              =Email
I_InputPIN                          =Please input the correct certificate password.
I_CertPINError                      =Error occurred when decoding, maybe because invalid password is used
I_CertFileError                     =Error occurred when decoding, maybe because invalid password is used
S_URLNull                           =URL is empty,please input
S_Save_Yes                          =Saved successfully
S_Save_No                           =Save failed
S_PIN_equal                         =New user password and confirm the password is not the same. Please check.
C_Btn_Confirm                       =OK
C_Btn_Cancel                        =Cancel(&C)
CSP11Name                           =GM3000HZTWCSP.dll
PKCS11Name                          =gm3000_pkcs11.dll
PROVIDER_NAME                       =Longmai GM3000 for HZ CSP V1.1
K_DefaultUPINInfo                   =The default user PIN is used, please modify it.
Import_Form_RBtn_CertMode2          =Signature(Signature/Validation only)
KeyName_Form_Lable                  =Please input new  name
Main_Form_Treeview                  =Token
Main_Form_ListView_Item1            =Field
Main_Form_ListView_ITem2            =Value
Main_Form_Lable                     =PKI Manager Tool
Main_Form_btn_Refresh               =Refresh
Main_Form_btn_SetUPIN               =Change User PIN
Main_Form_btn_SetKeyName            =Change Token Name
Main_Form_btn_Import                =Import Certificate
Main_Form_btn_Del                   =Delete Container
Main_Form_PopupMenu_listMain        =Show Main Window
Main_Form_PopupMenu_Advanced        =Settings
Main_Form_PopupMenu_CheceSystem     =System Information
Main_Form_PopupMenu_About           =About
Main_Form_PopupMenu_Close           =Exit
UPINSet_Form_NewPIN1                =New User PIN
UPINSet_Form_NewPIN2                =Confirm PIN
About_Form_label_CopyRight          =All Rights Reserved  2013 (C) Longmai Technology
About_Form_Label_URL_Info           =http://www.longmai.net
About_Form_Label_Email_Info         =info@longmai.net
CheckSys_Form_lv_Item1              =Field
CheckSys_Form_lv_Item2              =Value
Import_Form_GroupBox1               =Select a certificate file to import
Import_Form_GroupBox2               =Select Container
Import_Form_GroupBox3               =Type
Import_Form_Btn_Load                =Browse
Import_Form_Lable_Pwd               =File Password
Import_Form_RBtn_New                =New Container Name
Import_Form_RBtn_Old                =Existing Container
Import_Form_Btn_Random              =Random Name
Import_Form_RBtn_CertMode1          =Key Exchange(Encryption/Decryption etc.)
login_Form_label_keyname            =Token Name
Lonin_Form_lable_Key                =User PIN
Login_Form_btn_OK                   =Login(&L)
Login_Form__btn_cancel              =Cancel(&C)
Login_Form_LogonCount               =You can try times
Config_Form_GroupBox                =Configuration
Config_Form_CBOpenURL               =Access the website when Token inserted
Config_Form_RBtn1                   =System Default
Config_Form_RBtn2                   =IE
Config_Form_CBCertday               =Invalidation warning ahead
Config_Form_Lable                   =(0 - 365 day(s), 0 as on the expiration date)
Config_Form_btnSave                 =Save
Config_Form_Language                =Language
UPINSet_Form_OldPIN                 =Old User PIN
Main_Form_btn_Output                =Export Certificate
OutPut_OK                           =Export successfully
FontName                            =Tahoma
FontSize                            =8
K_Key_Remove                        =The Token has been removed!
CallMainAppName                     =GM3000PKIMgr.exe
SOPIN_Error                         =Wrong SO PIN
Change_No                           =Operate failed
Change_Yes                          =Operate successfully
SOPIN_E2                            =SO PIN code does not meet the length requirements!
UPIN_E2                             =User PIN code does not meet the length requirements!
K_Init_Info                         =After initialization USBKey the certificate will be cleared
K_Init_try                          =Whether to continue with the initialization?
K_User_error                        =Wrong User PIN
ISOFile_error                       =ISO file is not exist
ISO_Down_Yes                        =Download successfully
ISo_Down_No                         =Download failed
Admin_btn_Init                      =Initialize
Admin_btn_SOPIN                     =Set SO PIN
Admin_btn_Unlock                    =Unlock
Admin_btn_DownISO                   =Download ISO
Admin_label_TryCount                =Max PIN try count
Admin_label_SOPIN                   =SO PIN
Admin_label_UPIN                    =User PIN
btn_ViewCert                        =View
Admin_Name                          =Administrator
C_btn_Set                           =Set
Admin_label_OldSOPIN                =Old SO PIN
Admin_label_NewSOPIN1               =New SO PIN
Admin_label_NewSOPIN2               =Confirm SO PIN
Admin_label_NewUPIN1                =New user PIN
Admin_label_NewUPIN2                =Confirm user PIN
Admin_label_ISOPath                 =ISO file path
K_pkcs11Init_Error                  =pkcs11 initialization failed
K_Cert_Reg                          =Registration
K_Cert_UnReg                        =Unregistration
K_Len_Error                         =Parameter out of range
K_OutSpace_Error                    =Lack of space
K_Cont_Name_Error                   =Same container name, creation fails
Config_Form_DefaultPIN              =When the default password prompt modification
Init_Info                           =The device is not initialized, please contact the administrator
K_Cert_Del                          =Delete Certificate
config_Cert_Del                     =0
config_Cert_Input                   =0
config_Cert_Output                  =1
config_Cont_Del                     =0
MonName                             =GM3000Mon.exe
Update_Info                         =Detected in the new version, whether to update?
Update_Down_OK                      =The new version has been downloaded, is it installed?
Btn_Yes                             =Yes(&Y)
Btn_No                              =No(&N)
P_DefaultPIN_Info                   =Show this notification next time